МПР/src/Documents/ds_УстановкаКатегорийНоменклатуры/ds_УстановкаКатегорийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ds_УстановкаКатегорийНоменклатуры</name>
  <registerRecords>InformationRegister.ds_КатегорииНоменклатурыПлан</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ds_ВидыОперацийУстановкаКатегорийНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ds_КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МПР/src/Enums/ds_ВидыОперацийУстановкаКатегорийНоменклатуры/ds_ВидыОперацийУстановкаКатегорийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ds_ВидыОперацийУстановкаКатегорийНоменклатуры</name>
  <enumValues>
    <name>Установка</name>
  </enumValues>
  <enumValues>
    <name>Снятие</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Documents/ds_УстановкаКатегорийНоменклатуры/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда 
		Объект.Магазин = ПараметрыСеанса.ТекущийМагазин;
		Объект.ВидОперации = Перечисления.ds_ВидыОперацийУстановкаКатегорийНоменклатуры.Установка;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
	
	ВидимостьРеквизитов = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ds_ВидыОперацийУстановкаКатегорийНоменклатуры.Установка");
	
	Элементы.Категория.Видимость = ВидимостьРеквизитов;
	Элементы.ДатаОкончания.Видимость = ВидимостьРеквизитов;
	Элементы.ТоварыЦена.Видимость = ВидимостьРеквизитов;
	
КонецПроцедуры

#КонецОбласти
